<?php
return array(
	//'配置项'=>'配置值'
	3000 => '订单创建成功',
	3001 => '未传入商品id或格式不对',
	3002 => '传入的参数不完全或服务器内部错误,订单创建失败',
	3003 => '支付方式不存在',
	3004 => '订单创建成功,所有商品写入失败',
	3005 => '订单创建成功,部分商品写入失败',
	3006 => '选择的快递无法到达该地区',
	3007 => '缺少必要的参数,未传入用户id或订单id',
	3008 => '订单必须至少要有一件商品',
	3009 => 'uid,country,address,consignee不能为空',
	3010 => '积分至少xx起兑',
	
	2001 => '未传入access_token',
	2002 => 'access_token错误',
	2003 => 'access_token已过期,请重新授权',
	
	1000 => '正确返回',
	1001 => '缺少client_id或redirect_uri',
	1002 => '传入的redirect_uri与绑定的redirect_uri不一致',
	1003 => '未传入client_id或client_secret或code',
	1004 => 'code错误',
	1005 => '不存在的client_id',
	1006 => 'client_secret错误',
	1007 => '错误的请求方式,请使用post方式',
);